var salutions_storage = [{
        'num': [''],
        'salution': ['我', '本人', '鄙人', '在下', '不才', '吾', '余']
            }, {
        'num': ['1'],
        'salution': ['父亲', '爸(爸)', '爹(爹)', '老爷子', '大', '阿爸', '阿爹']
            }, {
        'num': ['2'],
        'salution': ['母亲', '妈(妈)', '娘', '娘亲', '阿妈', '阿娘', '老妈子']
            }, {
        'num': ['3'],
        'salution': ['丈夫', '先生', '爱人', '老公', '男人', '当家的', '孩他爹', '郎君', '夫君', '官人', '良人', '相公']
            }, {
        'num': ['4'],
        'salution': ['妻子', '太太', '爱人', '家属', '夫人', '老婆', '媳妇', '拙荆', '内人', '娘子', '室人', '婆娘', '婆姨', '浑家', '堂客', '屋里头的', '烧锅的', '孩他娘']
            }, {
        'num': ['5'],
        'salution': ['哥(哥)', '兄长', '兄上', '阿哥', '大哥', '二哥', 'X哥']
            }, {
        'num': ['6'],
        'salution': ['姐(姐)', '姊姊', '阿姊', '阿姐', '大姐', '二姐', 'X姐']
            }, {
        'num': ['7'],
        'salution': ['弟弟', '阿弟', '幺弟']
            }, {
        'num': ['8'],
        'salution': ['妹妹', '阿妹', '幺妹']
            }, {
        'num': ['9'],
        'salution': ['儿子', '娃娃', '娃儿', '仔仔', '崽崽', '崽儿', '阿囝', '囝囝', '囡囡', '阿囡', '鬼娃', '鬼头', '尕娃']
            }, {
        'num': ['10'],
        'salution': ['女儿', '丫头', '闺女', '千金', '娃娃', '娃儿', '仔仔', '崽崽', '崽儿', '阿囝', '囝囝', '囡囡', '阿囡', '尕头儿']
            }, {
        'num': ['11'],
        'salution': ['祖父', '爷爷', '大父', '王父']
            }, {
        'num': ['111'],
        'salution': ['曾祖父', '公太', '太爷爷', '太太', '太公', '太公公']
            }, {
        'num': ['1111'],
        'salution': ['高祖', '高祖父']
            }, {
        'num': ['11111'],
        'salution': ['天祖', '天祖父']
            }, {
        'num': ['111111'],
        'salution': ['烈祖', '烈祖父']
            }, {
        'num': ['1111111'],
        'salution': ['太祖', '太祖父']
            }, {
        'num': ['11111111'],
        'salution': ['远祖', '远祖父']
            }, {
        'num': ['111111111'],
        'salution': ['鼻祖', '鼻祖父']
            }, {
        'num': ['1111111112'],
        'salution': ['鼻祖母']
            }, {
        'num': ['111111112'],
        'salution': ['远祖母']
            }, {
        'num': ['11111112'],
        'salution': ['太祖母']
            }, {
        'num': ['1111112'],
        'salution': ['烈祖母']
            }, {
        'num': ['111112'],
        'salution': ['天祖母']
            }, {
        'num': ['11112'],
        'salution': ['高祖母']
            }, {
        'num': ['1112'],
        'salution': ['曾祖母', '太奶奶', '太太', '太婆婆']
            }, {
        'num': ['1115'],
        'salution': ['伯曾祖父', '族曾祖父', '从曾祖父']
            }, {
        'num': ['1117'],
        'salution': ['叔曾祖父', '族曾祖父', '从曾祖父']
            }, {
        'num': ['11154'],
        'salution': ['伯曾祖母', '族曾祖母', '从曾祖母']
            }, {
        'num': ['11174'],
        'salution': ['叔曾祖母', '族曾祖母', '从曾祖母']
            }, {
        'num': ['115'],
        'salution': ['伯祖父', '从祖父']
            }, {
        'num': ['117'],
        'salution': ['叔祖父', '从祖父']
            }, {
        'num': ['1154'],
        'salution': ['伯祖母', '从祖母']
            }, {
        'num': ['1174'],
        'salution': ['叔祖母', '从祖母']
            }, {
        'num': ['1159'],
        'salution': ['']
            }, {
        'num': ['54'],
        'salution': ['嫂嫂']
            }, {
        'num': ['59'],
        'salution': ['侄子']
            }, {
        'num': ['510'],
        'salution': ['侄女']
            }, {
        'num': ['593'],
        'salution': ['侄媳妇']
            }, {
        'num': ['5103'],
        'salution': ['侄女婿']
            }, {
        'num': ['79'],
        'salution': ['侄子']
            }, {
        'num': ['710'],
        'salution': ['侄女']
            }, {
        'num': ['793'],
        'salution': ['侄媳妇']
            }, {
        'num': ['7104'],
        'salution': ['侄女婿']
            }, {
        'num': ['69'],
        'salution': ['外甥']
            }, {
        'num': ['610'],
        'salution': ['外甥女']
            }, {
        'num': ['89'],
        'salution': ['外甥']
            }, {
        'num': ['810'],
        'salution': ['外甥女']
            }, {
        'num': ['694'],
        'salution': ['外甥媳妇']
            }, {
        'num': ['6103'],
        'salution': ['外甥女婿']
            }, {
        'num': ['894'],
        'salution': ['外甥媳妇']
            }, {
        'num': ['8103'],
        'salution': ['外甥女婿']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': ['99'],
        'salution': ['孙男']
            }, {
        'num': ['910'],
        'salution': ['孙女']
            }, {
        'num': ['999'],
        'salution': ['曾孙']
            }, {
        'num': ['9999'],
        'salution': ['玄孙']
            }, {
        'num': ['109'],
        'salution': ['贤外孙']
            }, {
        'num': ['1010'],
        'salution': ['贤外孙女']
            },

        ];
