var salutions_storage = [{
        'num': [''],
        'salution': ['我', '本人', '鄙人', '在下', '不才', '吾', '余']
            }, {
        'num': ['1'],
        'salution': ['父亲', '爸(爸)', '爹(爹)', '老爷子', '大', '阿爸', '阿爹']
            }, {
        'num': ['2'],
        'salution': ['母亲', '妈(妈)', '娘', '娘亲', '阿妈', '阿娘', '老妈子']
            }, {
        'num': ['3'],
        'salution': ['丈夫', '先生', '爱人', '老公', '男人', '当家的', '孩他爹', '郎君', '夫君', '官人', '良人', '相公']
            }, {
        'num': ['4'],
        'salution': ['妻子', '太太', '爱人', '家属', '夫人', '老婆', '媳妇', '拙荆', '内人', '娘子', '室人', '婆娘', '婆姨', '浑家', '堂客', '屋里头的', '烧锅的', '孩他娘']
            }, {
        'num': ['5'],
        'salution': ['哥(哥)', '兄长', '兄上', '阿哥', '大哥', '二哥', 'X哥']
            }, {
        'num': ['6'],
        'salution': ['姐(姐)', '姊姊', '阿姊', '阿姐', '大姐', '二姐', 'X姐']
            }, {
        'num': ['7'],
        'salution': ['弟弟', '阿弟', '幺弟']
            }, {
        'num': ['8'],
        'salution': ['妹妹', '阿妹', '幺妹']
            }, {
        'num': ['9'],
        'salution': ['儿子', '娃娃', '娃儿', '仔仔', '崽崽', '崽儿', '阿囝', '囝囝', '囡囡', '阿囡', '鬼娃', '鬼头', '尕娃']
            }, {
        'num': ['10'],
        'salution': ['女儿', '丫头', '闺女', '千金', '娃娃', '娃儿', '仔仔', '崽崽', '崽儿', '阿囝', '囝囝', '囡囡', '阿囡', '尕头儿']
            }, {
        'num': ['11'],
        'salution': ['祖父', '爷爷', '大父', '王父']
            }, {
        'num': ['12'],
        'salution': ['祖母', '奶奶', '阿婆']
            }, {
        'num': ['111'],
        'salution': ['曾祖父', '公太', '太爷爷', '太太', '太公', '太公公']
            }, {
        'num': ['1111'],
        'salution': ['高祖', '高祖父']
            }, {
        'num': ['11111'],
        'salution': ['天祖', '天祖父']
            }, {
        'num': ['111111'],
        'salution': ['烈祖', '烈祖父']
            }, {
        'num': ['1111111'],
        'salution': ['太祖', '太祖父']
            }, {
        'num': ['11111111'],
        'salution': ['远祖', '远祖父']
            }, {
        'num': ['111111111'],
        'salution': ['鼻祖', '鼻祖父']
            }, {
        'num': ['111111112'],
        'salution': ['鼻祖母']
            }, {
        'num': ['11111112'],
        'salution': ['远祖母']
            }, {
        'num': ['1111112'],
        'salution': ['太祖母']
            }, {
        'num': ['111112'],
        'salution': ['烈祖母']
            }, {
        'num': ['11112'],
        'salution': ['天祖母']
            }, {
        'num': ['1112'],
        'salution': ['高祖母']
            }, {
        'num': ['112'],
        'salution': ['曾祖母', '太奶奶', '太太', '太婆婆']
            }, {
        'num': ['1115'],
        'salution': ['伯曾祖父', '族曾祖父', '从曾祖父']
            }, {
        'num': ['1117'],
        'salution': ['叔曾祖父', '族曾祖父', '从曾祖父']
            }, {
        'num': ['11154'],
        'salution': ['伯曾祖母', '族曾祖母', '从曾祖母']
            }, {
        'num': ['11174'],
        'salution': ['叔曾祖母', '族曾祖母', '从曾祖母']
            }, {
        'num': ['115'],
        'salution': ['伯祖父', '从祖父','从祖祖父']
            }, {
        'num': ['117'],
        'salution': ['叔祖父', '从祖父','从祖祖父']
            }, {
        'num': ['1154'],
        'salution': ['伯祖母', '从祖母','从祖祖母']
            }, {
        'num': ['1174'],
        'salution': ['叔祖母', '从祖母','从祖祖母']
            }, {
        'num': ['15'],
        'salution': ['伯父']
            }, {
        'num': ['17'],
        'salution': ['叔父']
            }, {
        'num': ['154'],
        'salution': ['伯母']
            }, {
        'num': ['174'],
        'salution': ['叔母']
            }, {
        'num': ['159', '179'],
        'salution': ['堂兄（弟）']
            }, {
        'num': ['1510', '1710'],
        'salution': ['堂姐（妹）']
            }, {
        'num': ['16','18'],
        'salution': ['姑姑']
            }, {
        'num': ['163','183'],
        'salution': ['姑父']
            }, {
        'num': ['169','189','259','269','279','289'],
        'salution': ['表兄（弟）']
            }, {
        'num': ['1610','1810','2510','2610','2710','2810'],
        'salution': ['表姐（妹）']
            }, {
        'num': ['21'],
        'salution': ['外祖父','外公','姥爷','家爹']
            }, {
        'num': ['22'],
        'salution': ['外祖母','外婆','姥姥','家奶']
            }, {
        'num': ['25','27'],
        'salution': ['舅舅','舅父','舅太爷']
            }, {
        'num': ['26','28'],
        'salution': ['姨母','姨妈','姨娘']
            }, {
        'num': ['254','274'],
        'salution': ['舅妈','舅母']
            }, {
        'num': ['263','283'],
        'salution': ['姨夫']
            }, {
        'num': ['54'],
        'salution': ['嫂子']
            }, {
        'num': ['74'],
        'salution': ['弟妹', '弟媳']
            }, {
        'num': ['63'],
        'salution': ['姐夫']
            }, {
        'num': ['83'],
        'salution': ['妹夫']
            }, {
        'num': ['59', '79'],
        'salution': ['侄子']
            }, {
        'num': ['510', '710'],
        'salution': ['侄女']
            }, {
        'num': ['593', '793'],
        'salution': ['侄媳妇']
            }, {
        'num': ['5103', '7103'],
        'salution': ['侄女婿']
            }, {
        'num': ['69', '89'],
        'salution': ['外甥']
            }, {
        'num': ['610', '810'],
        'salution': ['外甥女']
            }, {
        'num': ['694', '894'],
        'salution': ['外甥媳妇']
            }, {
        'num': ['6103', '8103'],
        'salution': ['外甥女婿']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            }, {
        'num': [''],
        'salution': ['']
            },

        ];
